common-services/src/test/resources/com/osa/parsers/mockSoapDestinationStations.xml

<?xml version="1.0" encoding="UTF-8" ?>
<SOAP-ENV:Envelope xmlns:SOAP-ENV="http://schemas.xmlsoap.org/soap/envelope/">
    <SOAP-ENV:Header/>
    <SOAP-ENV:Body>
        <stationList xmlns="http://spring.io/guides/gs-producing-web-service">
            <station>
                <id>8889360200498779136</id>
                <code>94956495</code>
                <name>xxglnnoYLsQLj</name>
                <address>aZgww6YlYDL7rFtGPMaTJXbNcESAFC</address>
                <coordinates>
                    <latitude>57.188237052276236</latitude>
                    <longitude>INF</longitude>
                </coordinates>
                <city>
                    <id>4228807415846118400</id>
                    <name>zOIFoLdc</name>
                    <cityClass>A</cityClass>
                    <country>
                        <name>Haiti</name>
                        <code>HT</code>
                    </country>
                </city>
                <country>
                    <name>Lesotho</name>
                    <code>LS</code>
                </country>
            </station>
            <station>
                <id>4575042836708382720</id>
                <code>93275267</code>
                <name>aRJOtFuYgkAL</name>
                <address>6y5uf5YZeEy220Vn</address>
                <coordinates>
                    <latitude>65.12423866580507</latitude>
                    <longitude>INF</longitude>
                </coordinates>
                <city>
                    <id>7497416413279083520</id>
                    <name>ByQZNwUjH</name>
                    <cityClass>B</cityClass>
                    <country>
                        <name>Asia Pacific Region</name>
                        <code>AP</code>
                    </country>
                </city>
                <country>
                    <name>Bulgaria</name>
                    <code>BG</code>
                </country>
            </station>
            <station>
                <id>7231281634157449216</id>
                <code>16505729</code>
                <name>DfPUNFdcE</name>
                <address>vR1bw0cYTV3e5KLcEPZH</address>
                <coordinates>
                    <latitude>64.28667327205456</latitude>
                    <longitude>INF</longitude>
                </coordinates>
                <city>
                    <id>8215106000257337344</id>
                    <name>VeVXKzipdb</name>
                    <cityClass>B</cityClass>
                    <country>
                        <name>Lithuania</name>
                        <code>LT</code>
                    </country>
                </city>
                <country>
                    <name>Slovakia</name>
                    <code>SK</code>
                </country>
            </station>
            <station>
                <id>3552943023944360960</id>
                <code>65127187</code>
                <name>UWtlAzmhuoADiE</name>
                <address>Qc5biZ5CQIg2Qht</address>
                <coordinates>
                    <latitude>41.74891204291522</latitude>
                    <longitude>INF</longitude>
                </coordinates>
                <city>
                    <id>3219699208344174592</id>
                    <name>gFmsrzSnUPDxJpdKX</name>
                    <cityClass>C</cityClass>
                    <country>
                        <name>Gibraltar</name>
                        <code>GI</code>
                    </country>
                </city>
                <country>
                    <name>Kiribati</name>
                    <code>KI</code>
                </country>
            </station>
        </stationList>
    </SOAP-ENV:Body>
</SOAP-ENV:Envelope>